<?php
/**
* Language file for blog error/success messages
*
*/

return array(

    'blogcategory_exists'              => 'Категория блога уже создана!',
    'blogcategory_not_found'           => 'Категория Блога с id [:id] не существует.',
    'blogcategory_have_blog'           => 'Категория содержит активные блоги!',

    'success' => array(
        'create'    => 'Категория блогов успешно создана.',
        'update'    => 'Категория блогов успешно отредактирована.',
        'delete'    => 'Категория блогов успешно удалена.',
    ),

    'error' => array(
        'create'    => 'Возникли какие-то проблемы во время создания категории блога. Пожалуйста, повторите попытку позже.',
        'update'    => 'Возникли какие-то проблемы во время редактирования категории блога. Пожалуйста, повторите попытку позже.',
        'delete'    => 'Возникли какие-то проблемы во время удаления категории блога. Пожалуйста, повторите попытку позже.',
    ),

);
