<?php
/**
* Language file for user error/success messages
*
*/

return array(

    'user_exists'              => 'Пользователь уже существует!',
    'user_not_found'           => 'Пользователь с id [:id] не существует.',
    'user_login_required'      => 'Поле login обязательно для заполнения',
    'user_password_required'   => 'Поле password обязательно для заполнения.',
    'insufficient_permissions' => 'Недостаточные права доступа.',
    'banned'              => 'заблокирован',
    'suspended'             => 'временно приостановлен',

    'success' => array(
        'create'    => 'Учетная запись пользователя успешно создана.',
        'update'    => 'Учетная запись пользователя успешно отредактирована.',
        'delete'    => 'Учетная запись пользователя успешно удалена.',
        'ban'       => 'Учетная запись пользователя успешно заблокирована.',
        'unban'     => 'Учетная запись пользователя успешно разблокирована.',
        'suspend'   => 'Учетная запись пользователя успешно приостановлена.',
        'unsuspend' => 'Учетная запись пользователя успешно задействована.',
        'restored'  => 'Учетная запись пользователя успешно востановлена.'
    ),

    'error' => array(
        'create'    => 'Возникли какие-то проблемы во время создания учетной записи пользователя. Пожалуйста, повторите попытку позже.',
        'update'    => 'Возникли какие-то проблемы во время редактирования учетной записи пользователя. Пожалуйста, повторите попытку позже.',
        'delete'    => 'Возникли какие-то проблемы во время удаления учетной записи пользователя. Пожалуйста, повторите попытку позже.',
        'unsuspend' => 'Возникли какие-то проблемы во время разблокировки учетной записи пользователя. Пожалуйста, повторите попытку позже.',
    ),

);
