<?php
/**
* Language file for blog error/success messages
*
*/

return array(

    'blog_exists'              => 'Блог уже существует!',
    'blog_not_found'           => 'Блог с id [:id] не существует.',

    'success' => array(
        'create'    => 'Блог был успешно создан.',
        'update'    => 'Блог был успешно отредактирован.',
        'delete'    => 'Блог был успешно удален.',
    ),

    'error' => array(
        'create'    => 'Возникли какие-то проблемы во время создания блога. Пожалуйста, повторите попытку позже.',
        'update'    => 'Возникли какие-то проблемы во время редактирования блога. Пожалуйста, повторите попытку позже.',
        'delete'    => 'Возникли какие-то проблемы во время удаления блога. Пожалуйста, повторите попытку позже.',
    ),

);
